{"irVersion":"1.0","nodes":[{"id":"TinyExpressionP4::Formula","kind":"RuleDecl","span":{"start":0,"end":0}},{"id":"TinyExpressionP4::VariableDeclaration","kind":"RuleDecl","span":{"start":0,"end":0}},{"id":"TinyExpressionP4::TypeHint","kind":"RuleDecl","span":{"start":0,"end":0}},{"id":"TinyExpressionP4::Setter","kind":"RuleDecl","span":{"start":0,"end":0}},{"id":"TinyExpressionP4::Description","kind":"RuleDecl","span":{"start":0,"end":0}},{"id":"TinyExpressionP4::MethodDeclaration","kind":"RuleDecl","span":{"start":0,"end":0}},{"id":"TinyExpressionP4::MethodParameters","kind":"RuleDecl","span":{"start":0,"end":0}},{"id":"TinyExpressionP4::MethodParameter","kind":"RuleDecl","span":{"start":0,"end":0}},{"id":"TinyExpressionP4::ReturnType","kind":"RuleDecl","span":{"start":0,"end":0}},{"id":"TinyExpressionP4::MethodInvocation","kind":"RuleDecl","span":{"start":0,"end":0}},{"id":"TinyExpressionP4::Arguments","kind":"RuleDecl","span":{"start":0,"end":0}},{"id":"TinyExpressionP4::NumberExpression","kind":"RuleDecl","span":{"start":0,"end":0}},{"id":"TinyExpressionP4::NumberTerm","kind":"RuleDecl","span":{"start":0,"end":0}},{"id":"TinyExpressionP4::AddOp","kind":"RuleDecl","span":{"start":0,"end":0}},{"id":"TinyExpressionP4::MulOp","kind":"RuleDecl","span":{"start":0,"end":0}},{"id":"TinyExpressionP4::NumberFactor","kind":"RuleDecl","span":{"start":0,"end":0}},{"id":"TinyExpressionP4::StringExpression","kind":"RuleDecl","span":{"start":0,"end":0}},{"id":"TinyExpressionP4::BooleanExpression","kind":"RuleDecl","span":{"start":0,"end":0}},{"id":"TinyExpressionP4::ObjectExpression","kind":"RuleDecl","span":{"start":0,"end":0}},{"id":"TinyExpressionP4::IfExpression","kind":"RuleDecl","span":{"start":0,"end":0}},{"id":"TinyExpressionP4::NumberMatchExpression","kind":"RuleDecl","span":{"start":0,"end":0}},{"id":"TinyExpressionP4::NumberCase","kind":"RuleDecl","span":{"start":0,"end":0}},{"id":"TinyExpressionP4::NumberDefaultCase","kind":"RuleDecl","span":{"start":0,"end":0}},{"id":"TinyExpressionP4::VariableRef","kind":"RuleDecl","span":{"start":0,"end":0}},{"id":"TinyExpressionP4::Expression","kind":"RuleDecl","span":{"start":0,"end":0}}],"source":"/mnt/c/var/unlaxer-temp/tinyexpression/docs/ubnf/tinyexpression-p4-draft.ubnf","scopeEvents":[{"event":"enterScope","scopeId":"scope:TinyExpressionP4::MethodDeclaration","scopeMode":"lexical","span":{"start":0,"end":0}},{"event":"leaveScope","scopeId":"scope:TinyExpressionP4::MethodDeclaration","scopeMode":"lexical","span":{"start":0,"end":0}}],"diagnostics":[],"annotations":[{"targetId":"TinyExpressionP4::Formula","name":"root","payload":{"enabled":true}},{"targetId":"TinyExpressionP4::VariableDeclaration","name":"interleave","payload":{"profile":"javaStyle"}},{"targetId":"TinyExpressionP4::MethodDeclaration","name":"scope-tree","payload":{"mode":"lexical"}},{"targetId":"TinyExpressionP4::MethodInvocation","name":"backref","payload":{"name":"methodName"}},{"targetId":"TinyExpressionP4::NumberExpression","name":"mapping","payload":{"className":"BinaryExpr","params":["left","op","right"]}},{"targetId":"TinyExpressionP4::NumberExpression","name":"left-assoc","payload":{"assoc":"left"}},{"targetId":"TinyExpressionP4::NumberExpression","name":"precedence","payload":{"level":10}},{"targetId":"TinyExpressionP4::NumberTerm","name":"mapping","payload":{"className":"BinaryExpr","params":["left","op","right"]}},{"targetId":"TinyExpressionP4::NumberTerm","name":"left-assoc","payload":{"assoc":"left"}},{"targetId":"TinyExpressionP4::NumberTerm","name":"precedence","payload":{"level":20}}]}